melair/ktane/Firmware/Common/hal/polyfill/pic18f57q84.h
#define PPS_OUT_LATXY 0x00

#define PPS_OUT_CLC1OUT 0x01
#define PPS_OUT_CLC2OUT 0x02
#define PPS_OUT_CLC3OUT 0x03
#define PPS_OUT_CLC4OUT 0x04
#define PPS_OUT_CLC5OUT 0x05
#define PPS_OUT_CLC6OUT 0x06
#define PPS_OUT_CLC7OUT 0x07
#define PPS_OUT_CLC8OUT 0x08

#define PPS_OUT_CWG1A 0x09
#define PPS_OUT_CWG1B 0x0A
#define PPS_OUT_CWG1C 0x0B
#define PPS_OUT_CWG1D 0x0C
#define PPS_OUT_CWG2A 0x0D
#define PPS_OUT_CWG2B 0x0E
#define PPS_OUT_CWG2C 0x0F
#define PPS_OUT_CWG2D 0x10
#define PPS_OUT_CWG3A 0x11
#define PPS_OUT_CWG3B 0x12
#define PPS_OUT_CWG3C 0x13
#define PPS_OUT_CWG3D 0x14

#define PPS_OUT_CCP1 0x15
#define PPS_OUT_CCP2 0x16
#define PPS_OUT_CCP3 0x17

#define PPS_OUT_PWM1S1P1 0x18
#define PPS_OUT_PWM1S1P2 0x19
#define PPS_OUT_PWM2S1P1 0x1A
#define PPS_OUT_PWM2S1P2 0x1B
#define PPS_OUT_PWM3S1P1 0x1C
#define PPS_OUT_PWM3S1P2 0x1D
#define PPS_OUT_PWM4S1P1 0x1E
#define PPS_OUT_PWM4S1P2 0x1F

#define PPS_OUT_UART1_TX 0x20
#define PPS_OUT_UART1_TXDE 0x21
#define PPS_OUT_UART1_RTS 0x22
#define PPS_OUT_UART2_TX 0x23
#define PPS_OUT_UART2_TXDE 0x24
#define PPS_OUT_UART2_RTS 0x25
#define PPS_OUT_UART3_TX 0x26
#define PPS_OUT_UART3_TXDE 0x27
#define PPS_OUT_UART3_RTS 0x28
#define PPS_OUT_UART4_TX 0x29
#define PPS_OUT_UART4_TXDE 0x2A
#define PPS_OUT_UART4_RTS 0x2B
#define PPS_OUT_UART5_TX 0x2C
#define PPS_OUT_UART5_TXDE 0x2D
#define PPS_OUT_UART5_RTS 0x2E

#define PPS_OUT_C1OUT 0x2F
#define PPS_OUT_C2OUT 0x30

#define PPS_OUT_SPI1_SCK 0x31
#define PPS_OUT_SPI1_SDO 0x32
#define PPS_OUT_SPI1_SS 0x33
#define PPS_OUT_SPI2_SCK 0x34
#define PPS_OUT_SPI2_SDO 0x35
#define PPS_OUT_SPI2_SS 0x36

#define PPS_OUT_I2C1_SCL 0x37
#define PPS_OUT_I2C1_SDA 0x38

#define PPS_OUT_TMR0 0x39
#define PPS_OUT_TU16A 0x3A
#define PPS_OUT_TU16B 0x3B

#define PPS_OUT_NCO1 0x3F
#define PPS_OUT_NCO2 0x40
#define PPS_OUT_NCO3 0x41

#define PPS_OUT_CLKR 0x42
#define PPS_OUT_DSM1 0x43
#define PPS_OUT_ADGRDA 0x44
#define PPS_OUT_ADGRDB 0x45
#define PPS_OUT_CANTX 0x46

#define DMA_TRIG_HLVD 0x01
#define DMA_TRIG_OSF 0x02
#define DMA_TRIG_CSW 0x03
#define DMA_TRIG_TU16A 0x04
#define DMA_TRIG_CLC1 0x05
#define DMA_TRIG_CAN_ERR 0x06
#define DMA_TRIG_IOC 0x07
#define DMA_TRIG_INT0 0x08
#define DMA_TRIG_ZCD 0x09
#define DMA_TRIG_AD 0x0A
#define DMA_TRIG_ACT 0x0B
#define DMA_TRIG_CM1 0x0C
#define DMA_TRIG_SMT1 0x0D
#define DMA_TRIG_SMT1PRA 0x0E
#define DMA_TRIG_SMT1PWA 0x0F
#define DMA_TRIG_ADCH0 0x10
#define DMA_TRIG_ADCH1 0x11
#define DMA_TRIG_ADCH2 0x12
#define DMA_TRIG_ADCH3 0x13
#define DMA_TRIG_DMA1SCNT 0x14
#define DMA_TRIG_DMA1DCNT 0x15
#define DMA_TRIG_DMA1OR 0x16
#define DMA_TRIG_DMA1A 0x17
#define DMA_TRIG_SPI1RX 0x18
#define DMA_TRIG_SPI1TX 0x19
#define DMA_TRIG_SPI1 0x1A
#define DMA_TRIG_TMR2 0x1B
#define DMA_TRIG_TMR1 0x1C
#define DMA_TRIG_TMR1G 0x1D
#define DMA_TRIG_CCP1 0x1E
#define DMA_TRIG_TMR0 0x1F

#define DMA_TRIG_U1RX 0x20
#define DMA_TRIG_U1TX 0x21
#define DMA_TRIG_U1E 0x22
#define DMA_TRIG_U1 0x23
#define DMA_TRIG_CANRX 0x24
#define DMA_TRIG_CANTX 0x25
#define DMA_TRIG_PWM1RINT 0x26
#define DMA_TRIG_PWM1GINT 0x27
#define DMA_TRIG_SPI2RX 0x28
#define DMA_TRIG_SPI2TX 0x29
#define DMA_TRIG_SPI2 0x2A
#define DMA_TRIG_TU16B 0x2B
#define DMA_TRIG_TMR3 0x2C
#define DMA_TRIG_TMR3G 0x2D
#define DMA_TRIG_PWM2RINT 0x2E
#define DMA_TRIG_PWM2GINT 0x2F
#define DMA_TRIG_INT1 0x30
#define DMA_TRIG_CLC2 0x31
#define DMA_TRIG_CWG1 0x32
#define DMA_TRIG_NCO1 0x33
#define DMA_TRIG_DMA2SCNT 0x34
#define DMA_TRIG_DMA2DCNT 0x35
#define DMA_TRIG_DMA2OR 0x36
#define DMA_TRIG_DMA2A 0x37
#define DMA_TRIG_I2C1RX 0x38
#define DMA_TRIG_I2C1TX 0x39
#define DMA_TRIG_I2C1 0x3A
#define DMA_TRIG_I2C1E 0x3B
#define DMA_TRIG_CLC3 0x3D
#define DMA_TRIG_PWM3RINT 0x3E
#define DMA_TRIG_PWM3GINT 0x3F

#define DMA_TRIG_U2RX 0x40
#define DMA_TRIG_U2TX 0x41
#define DMA_TRIG_U2E 0x42
#define DMA_TRIG_U2 0x43
#define DMA_TRIG_TMR5 0x44
#define DMA_TRIG_TMR5G 0x45
#define DMA_TRIG_CCP2 0x46
#define DMA_TRIG_SCAN 0x47
#define DMA_TRIG_U3RX 0x48
#define DMA_TRIG_U3TX 0x49
#define DMA_TRIG_U3E 0x4A
#define DMA_TRIG_U3 0x4B
#define DMA_TRIG_CLC4 0x4D
#define DMA_TRIG_PWM4RINT 0x4E
#define DMA_TRIG_PWM4GINT 0x4F
#define DMA_TRIG_INT2 0x50
#define DMA_TRIG_CLC5 0x51
#define DMA_TRIG_CWG2 0x52
#define DMA_TRIG_NCO2 0x53
#define DMA_TRIG_DMA3SCNT 0x54
#define DMA_TRIG_DMA3DCNT 0x55
#define DMA_TRIG_DMA3OR 0x56
#define DMA_TRIG_DMA3A 0x57
#define DMA_TRIG_CCP3 0x58
#define DMA_TRIG_CLC6 0x59
#define DMA_TRIG_CWG3 0x5A
#define DMA_TRIG_TMR4 0x5B
#define DMA_TRIG_DMA4SCNT 0x5C
#define DMA_TRIG_DMA4DCNT 0x5D
#define DMA_TRIG_DMA4OR 0x5E
#define DMA_TRIG_DMA4A 0x5F

#define DMA_TRIG_U4RX 0x60
#define DMA_TRIG_U4TX 0x61
#define DMA_TRIG_U4E 0x62
#define DMA_TRIG_U4 0x63
#define DMA_TRIG_DMA5SCNT 0x64
#define DMA_TRIG_DMA5DCNT 0x65
#define DMA_TRIG_DMA5OR 0x66
#define DMA_TRIG_DMA5A 0x67
#define DMA_TRIG_U5RX 0x68
#define DMA_TRIG_U5TX 0x69
#define DMA_TRIG_U5E 0x6A
#define DMA_TRIG_U5 0x6B
#define DMA_TRIG_DMA6SCNT 0x6C
#define DMA_TRIG_DMA6DCNT 0x6D
#define DMA_TRIG_DMA6OR 0x6E
#define DMA_TRIG_DMA6A 0x6F
/* 0x70 reserved */
#define DMA_TRIG_CLC7 0x71
#define DMA_TRIG_CM2 0x72
#define DMA_TRIG_NCO3 0x73
#define DMA_TRIG_DMA7SCNT 0x74
#define DMA_TRIG_DMA7DCNT 0x75
#define DMA_TRIG_DMA7OR 0x76
#define DMA_TRIG_DMA7ABRT 0x77
#define DMA_TRIG_NVM 0x78
#define DMA_TRIG_CLC8 0x79
#define DMA_TRIG_CRC 0x7A
#define DMA_TRIG_TMR6 0x7B
#define DMA_TRIG_DMA8SCNT 0x7C
#define DMA_TRIG_DMA8DCNT 0x7D
#define DMA_TRIG_DMA8OR 0x7E
#define DMA_TRIG_DMA8ABRT 0x7F

#define DMA_TRIG_TU16APR 0x80
#define DMA_TRIG_TU16ACAPT 0x81
#define DMA_TRIG_TU16AZERO 0x82
#define DMA_TRIG_TU16BPR 0x83
#define DMA_TRIG_TU16BCAPT 0x84
#define DMA_TRIG_TU16BZERO 0x85
#define DMA_TRIG_PWM1S1P1 0x90
#define DMA_TRIG_PWM1S1P2 0x91
#define DMA_TRIG_PWM2S1P1 0x92
#define DMA_TRIG_PWM2S1P2 0x93
#define DMA_TRIG_PWM3S1P1 0x94
#define DMA_TRIG_PWM3S1P2 0x95
#define DMA_TRIG_PWM4S1P1 0x96
#define DMA_TRIG_PWM4S1P2 0x97

#define CLC_SRC_CLCIN0PPS 0x00
#define CLC_SRC_CLCIN1PPS 0x01
#define CLC_SRC_CLCIN2PPS 0x02
#define CLC_SRC_CLCIN3PPS 0x03
#define CLC_SRC_CLCIN4PPS 0x04
#define CLC_SRC_CLCIN5PPS 0x05
#define CLC_SRC_CLCIN6PPS 0x06
#define CLC_SRC_CLCIN7PPS 0x07
#define CLC_SRC_FOSC 0x08
#define CLC_SRC_HFINTOSC 0x09
#define CLC_SRC_LFINTOSC 0x0A
#define CLC_SRC_MFINTOSC 0x0B
#define CLC_SRC_MFINTOSC_32KHZ 0x0C
#define CLC_SRC_SFINTOSC_1MHZ 0x0D
#define CLC_SRC_SOSC 0x0E
#define CLC_SRC_EXTOSC 0x0F
#define CLC_SRC_ADCRC 0x10
#define CLC_SRC_CLKR 0x11
#define CLC_SRC_TMR0 0x12
#define CLC_SRC_TMR1 0x13
#define CLC_SRC_TMR2 0x14
#define CLC_SRC_TMR3 0x15
#define CLC_SRC_TMR4 0x16
#define CLC_SRC_TMR5 0x17
#define CLC_SRC_TMR6 0x18
#define CLC_SRC_TU16A 0x19
#define CLC_SRC_TU16B 0x1A
/* 0x1B reserved */
/* 0x1C reserved */
#define CLC_SRC_SMT1 0x1E
#define CLC_SRC_CCP1 0x1F
#define CLC_SRC_CCP2 0x20
#define CLC_SRC_CCP3 0x21
#define CLC_SRC_PWM1S1P1_OUT 0x22
#define CLC_SRC_PWM1S1P2_OUT 0x23
#define CLC_SRC_PWM2S1P1_OUT 0x24
#define CLC_SRC_PWM2S1P2_OUT 0x25
#define CLC_SRC_PWM3S1P1_OUT 0x26
#define CLC_SRC_PWM3S1P2_OUT 0x27
#define CLC_SRC_PWM4S1P1_OUT 0x28
#define CLC_SRC_PWM4S1P2_OUT 0x29
#define CLC_SRC_NCO1 0x2A
#define CLC_SRC_NCO2 0x2B
#define CLC_SRC_NCO3 0x2C
#define CLC_SRC_CMP1_OUT 0x2D
#define CLC_SRC_CMP2_OUT 0x2E
#define CLC_SRC_ZCD 0x2F
#define CLC_SRC_IOC 0x30
#define CLC_SRC_DSM1 0x31
#define CLC_SRC_HLVD_OUT 0x32
#define CLC_SRC_CLC1 0x33
#define CLC_SRC_CLC2 0x34
#define CLC_SRC_CLC3 0x35
#define CLC_SRC_CLC4 0x36
#define CLC_SRC_CLC5 0x37
#define CLC_SRC_CLC6 0x38
#define CLC_SRC_CLC7 0x39
#define CLC_SRC_CLC8 0x3A
#define CLC_SRC_U1TX 0x3B
#define CLC_SRC_U2TX 0x3C
#define CLC_SRC_U3TX 0x3D
#define CLC_SRC_U4TX 0x3E
#define CLC_SRC_U5TX 0x3F
#define CLC_SRC_SPI1_SDO 0x40
#define CLC_SRC_SPI1_SCK 0x41
#define CLC_SRC_SPI1_SS 0x42
#define CLC_SRC_SPI2_SDO 0x43
#define CLC_SRC_SPI2_SCK 0x44
#define CLC_SRC_SPI2_SS 0x45
#define CLC_SRC_I2C_SCL 0x46
#define CLC_SRC_I2C_SDA 0x47
#define CLC_SRC_CWG1A 0x48
#define CLC_SRC_CWG1B 0x49
#define CLC_SRC_CWG2A 0x4A
#define CLC_SRC_CWG2B 0x4B
#define CLC_SRC_CWG3A 0x4C
#define CLC_SRC_CWG3B 0x4D

#define CAN_MODE_NORMAL_CAN_FD 0b000
#define CAN_MODE_DISABLE 0b001
#define CAN_MODE_INTERNAL_LOOPBACK 0b010
#define CAN_MODE_LISTEN_ONLY 0b011
#define CAN_MODE_CONFIG 0b100
#define CAN_MODE_EXTERNAL_LOOPBACK 0b101
#define CAN_MODE_NORMAL_CAN_2 0b110
#define CAN_MODE_RESTRICTED 0b111

#define EEPROM_SIZE 1024